In [1]:
import pandas as pd
import numpy as np

In [2]:
df_stops = pd.read_csv('stops.csv')
df_stops.head()

,stop_id,stop_code,stop_name,stop_desc,stop_lat,stop_lon,zone_id,stop_url,location_type,parent_station,stop_timezone,wheelchair_boarding
0,32769,151131,Forest Office Road,NaN,18.51983,73.63158,NaN,NaN,NaN,NaN,NaN,NaN
1,32770,152339,Kusalkar Putala,NaN,18.52889,73.82708,NaN,NaN,NaN,NaN,NaN,NaN
2,32771,154648,Tower Line,NaN,18.67007,73.78613,NaN,NaN,NaN,NaN,NaN,NaN
3,32772,153069,Nehrunagar Depot,NaN,18.62930,73.81942,NaN,NaN,NaN,NaN,NaN,NaN
4,32773,151724,Jagtap Chowk,NaN,18.49153,73.90019,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df_stops[['stop_lat','stop_lon']].isna().any()

stop_lat    False
stop_lon    False
dtype: bool

In [4]:
df_stops.dropna(axis=1,inplace=True)
df_stops.head()

   stop_id stop_code           stop_name  stop_lat  stop_lon
0    32769    151131  Forest Office Road  18.51983  73.63158
1    32770    152339     Kusalkar Putala  18.52889  73.82708
2    32771    154648          Tower Line  18.67007  73.78613
3    32772    153069    Nehrunagar Depot  18.62930  73.81942
4    32773    151724        Jagtap Chowk  18.49153  73.90019

In [5]:
df_stops.drop(columns=['stop_code','stop_id'],inplace=True)
df_stops.head()

            stop_name  stop_lat  stop_lon
0  Forest Office Road  18.51983  73.63158
1     Kusalkar Putala  18.52889  73.82708
2          Tower Line  18.67007  73.78613
3    Nehrunagar Depot  18.62930  73.81942
4        Jagtap Chowk  18.49153  73.90019